{
  "title": "Crazy story at PUT",
  "description": "Something very, very strange is happening at the Poznań University of Technology. Let's find out what is going on!",
  "events": [
    {
      "id": "start",
      "title": "Welcome to PUT",
      "text": "It's a normal day on Lecture Centre of Poznań University of Technology. You are casually walking near the dressing room, trying to get through the large crowd of students, when suddenly you hear a loud scream coming from somewhere, probably somewhere from the first floor. What do you do, adventurer?",
      "options": [
        {
          "text": "Go to the first floor and see what's going on.",
          "goto": "challenge-accepted"
        },
        {
          "text": "Who cares? Let's just ignore this weird stuff.",
          "goto": "lazy"
        }
      ]
    },
    {
      "id": "challenge-accepted",
      "title": "What is going on?",
      "text": "You quickly run to the first floor. You look around, but at the first sight, nothing seems special. People normally sit at the desks on the corridor, looking at screens of their computers and don't even notice you. Suddenly, near the room L125 you see some weird-shaped object that vanishes behind the corner before you manage to see what it is. You go in this direction, and you see a girl crying in the corner.",
      "options": [
        {
          "text": "Let's ask her what happened",
          "goto": {
            "girl-tells-a-story": 0.5,
            "girl-is-terrified": 0.5
          }
        },
        {
          "text": "Let's just go further",
          "goto": "meeting-the-creature"
        }
      ]
    },
    {
      "id": "lazy",
      "title": "You are lazy!",
      "text": "Why are you playing this game, adventurer, if you do not want to dive into the interesting and fun story? What a shame! Gods of the game have send you back to the beginning. You have a chance to fix your mistake."
    },
    {
      "id": "girl-tells-a-story",
      "title": "Talking to a crying girl",
      "text": "You approach the crying girl. \"What happened?\", you ask. She loooks at you with tears in her eyes and says: \"I have been attacked by an abnormal creature that was running through the hall. It had seven heads, seven legs and was made of large green sticks!\"",
      "options": [
        {
          "text": "Got that!",
          "goto": "meeting-the-creature"
        }
      ]
    },
    {
      "id": "girl-is-terrified",
      "title": "Talking to a crying girl",
      "text": "You approach the crying girl. \"What happened?\", you ask. She does not respond. You ask once again, but you receive no answer. She clearly seems extremely terrified.",
      "options": [
        {
          "text": "Let's go further",
          "goto": "meeting-the-creature"
        }
      ]
    },
    {
      "id": "meeting-the-creature",
      "title": "Epic clash",
      "text": "You go in the direction in which you believe the creature has gone. You pass the library, go through a secret passage and get to a Bridge of Glass. Suddenly, you see it - a terrifying monster with no particular shape, green, made of huge segments, moving slowly in a chaotic way. It stops right in front of you and, despite it having no eyes, you feel like it is staring at you, ready to attack.",
      "options": [
        {
          "text": "Do I know what is it?",
          "goto": {
            "you-know-what-is-it": 0.9,
            "you-dont-know-what-is-it": 0.1
          }
        }
      ]
    },
    {
      "id": "you-know-what-is-it",
      "title": "You know what that thing is!",
      "text": "It seems that you have a high insight and suddenly, all the dots connect and you recall a story told by some friends from the first year of AI about weird computer creatures Framsticks that were capable of evolving and were a nightmare for the students. If they were simulated though, how is it possible that you see one in a physical form in front of you? Surely, at some point of evolution on PUT supercomputers in the basement they must have become more than just a simulation!",
      "options": [
        {
          "text": "OK, let's fight this thing!",
          "goto": "rolling-a-dice"
        }
      ]
    },
    {
      "id": "you-dont-know-what-is-it",
      "title": "You don't know what that thing is!",
      "text": "Oh no! Seems like your insight is too low! You have no idea what you are fighting against. Well, that's a pity, but you can still fight!",
      "options": [
        {
          "text": "OK, let's fight this thing!",
          "goto": "rolling-a-dice"
        }
      ]
    },
    {
      "id": "rolling-a-dice",
      "title": "Fight!",
      "text": "You reach into your pocket. Fortunately, you find a 20-sided dice that you have from a DnD session with your friends last night. You roll it on the floor for an attack.",
      "options": [
        {
          "text": "Let's see the result!",
          "goto": {
            "critical-failure": 0.2,
            "critical-success": 0.3,
            "medium-result": 0.5
          }
        }
      ]
    },
    {
      "id": "critical-failure",
      "title": "Attack!",
      "text": "You look at the dice. Oh no, it's 1 - the critical failure! You approach the creature and attempt to punch it in the face. However, the creature has no face and you accidentially punch yourself. You die!"
    },
    {
      "id": "critical-success",
      "title": "Attack!",
      "text": "You look at the dice. Oh yes, it's 20 - the critical success. You approach the creature and punch it with such a strength that it literally dissolves into tiny pieces. The monster is defeated and the epic battle for PUT is won!",
      "options": [
        {
          "text": "Amazing!",
          "goto": "victory"
        }
      ]
    },
    {
      "id": "medium-result",
      "title": "Attack!",
      "text": "You look at the dice. You've got 12. You punch the creature with a solid strength. The creature shakes and runs, disappearing behind the corner.",
      "options": [
        {
          "text": "Let's follow it",
          "goto": "evolution"
        }
      ]
    },
    {
      "id": "evolution",
      "title": "Oh no!",
      "text": "You follow the creature. You turn right and in the corridor, you see it once again. However, something has changed. There is no sign of damage from your encounter a few moments back. The monster is about 3 times larger - it must have evolved! And it seems very, very angry! What do you do, adventurer?",
      "options": [
        {
          "text": "Retreat!",
          "goto": "retreat"
        },
        {
          "text": "Let's attack it once again!",
          "goto": "fight-with-no-chances"
        }
      ]
    },
    {
      "id": "retreat",
      "title": "Retreat!",
      "text": "You run away, choosing the same path with which you reached this place. You hear heavy steps of the creature right behind you. You pass the Bridge of Glass. Suddenly, you hear loud cracks. You turn around and see that the creature is so heavy now that the bridge collapses. The createure falls to its death. The battle for PUT is won!",
      "options": [
        {
          "text": "Amazing!",
          "goto": "victory"
        }
      ]
    },
    {
      "id": "fight-with-no-chances",
      "title": "Attack!",
      "text": "You try to punch it once again, but before you roll your dice to see how strong the punch will be, the creature grabs you with its green arm (if you can call it so) and throws you very far. You fall and die!"
    },
    {
      "id": "victory",
      "title": "Congratulations!",
      "text": "The physical embodiment of framsticks have been stopped from evolving and overtaking the Poznań University of Technology, and later maybe even the entire world. You are the true hero, adventurer. As a reward, you receive the honorable title of Professor of RPG."
    }
  ]
}
